//
//  BelarusianCities.swift
//  Karmus
//
//  Created by VironIT on 8/31/22.
//

import Foundation

class Belarus {
    static let shared = Belarus.init(regions: [
        BelarusRegion.init("Брестская область", [
            "Антополь", "Барановичи", "Белоозерск",
            "Береза", "Береза Картуска", "Брест",
            "Высокое", "Ганцевичи", "Городище",
            "Давид-Городок", "Домачево", "Дрогичин",
            "Жабинка", "Иваново", "Ивацевичи",
            "Каменец", "Кобрин", "Коссово",
            "Лунинец", "Ляховичи", "Малорита",
            "Микашевичи", "Пинск", "Пружаны",
            "Столин"
        ]),
        BelarusRegion.init("Витебская область", [
            "Барань", "Бегомль", "Бешенковичи",
            "Богушевск", "Браслав", "Верхнедвинск",
            "Ветрино", "Видзы", "Витебск",
            "Воропаево", "Глубокое", "Городок",
            "Дисна", "Докшицы", "Друя",
            "Дубровно", "Езерище", "Лепель",
            "Лиозно", "Миоры", "Новолукомль",
            "Новополоцк", "Орша", "Полоцк",
            "Поставы", "Россоны", "Сенно",
            "Толочин", "Ушачи", "Чашники",
            "Шарковщина", "Шумилино"
        ]),
        BelarusRegion.init("Гомельская область", [
            "Белицк", "Большевик", "Брагин",
            "Буда-Кошелево", "Василевичи", "Васильевка",
            "Ветка", "Гомель", "Добруш",
            "Ельск", "Житковичи", "Жлобин",
            "Калинковичи", "Корма", "Лельчицы",
            "Лоев", "Мозырь", "Наровля",
            "Октябрьский", "Петриков", "Речица",
            "Рогачев", "Светлогорск", "Туров",
            "Хойники", "Чечерск"
        ]),
        BelarusRegion.init("Гродненская область", [
            "Берёзовка", "Большая Берестовица", "Волковыск",
            "Вороново", "Гродно", "Дятлово",
            "Желудок", "Зельва", "Ивье",
            "Козловщина", "Кореличи", "Лида",
            "Мосты", "Новогрудок", "Островец",
            "Ошмяны", "Свислочь", "Скидель",
            "Слоним", "Сморгонь", "Щучин"
        ]),
        BelarusRegion.init("Минская область", [
            "Березино", "Бобр", "Борисов", "Вилейка",
            "Воложин", "Городея", "Дзержинск", "Жодино", "Заславль",
            "Зеленый Бор", "Ивенец", "Клецк",
            "Копыль", "Крупки", "Логойск",
            "Марьина горка", "Молодечно", "Мядель",
            "Несвиж", "Пуховичи", "Раков",
            "Руденск", "Слуцк", "Смолевичи",
            "Солигорск", "Старые дороги", "Столбцы",
            "Узда", "Фаниполь", "Червень"
        ]),
        BelarusRegion.init("Могилевская область", [
            "Асеньковичи", "Белыничи", "Бобруйск", "Быхов",
            "Глуск", "Глуша", "Горки", "Гродзянка", "Елизово",
            "Дрибин", "Климовичи", "Кличев",
            "Костюковичи", "Краснополье", "Кричев",
            "Круглое", "Могилев", "Мстиславль",
            "Осиповичи", "Славгород", "Хотимск",
            "Чаусы", "Чериков", "Шклов"
        ]),
        BelarusRegion.init()
    ])
    
    let countryName = "Беларусь"
    let regions: [BelarusRegion]
    
    lazy var allCities: [String] =  {
    
        regions.flatMap{ region in
            
            region.cities?.map {
                $0 + ", \(region.regionName)"
            } ?? [region.regionName]
            
        }.sorted(by: <)
        
    }()
    
    init(regions: [BelarusRegion]) {
        self.regions = regions
    }
}

struct BelarusRegion{
    let regionName: String
    let cities: [String]?
    
    init(_ regionName: String, _ cities: [String]) {
        self.regionName = regionName
        self.cities = cities
    }
    
    init() {
        regionName = "Минск"
        cities = nil
    }
}
